In [ ]:
pip install mysqlclient

In [ ]:
pip install pymysql

In [1]:
import pandas as pd
import numpy as np

In [ ]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
query = """SELECT * FROM salaries ORDER BY salary DESC LIMIT 10"""
df = pd.read_sql(query, url)
df

In [47]:
# 1 Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:
from pydataset import data
mpg = data('mpg') # load the dataset and store it in a variable
# data('mpg', show_doc=True) # view the documentation for the dataset
cars = pd.DataFrame(mpg)

In [63]:
# On average, which manufacturer has the best miles per gallon?
print(cars.info())
manufacturers = cars.groupby("manufacturer").mean()
cars['average_mileage'] = (cars.cty + cars.hwy) / 2
best_mpg = manufacturers.sort_values(by='average_mileage', ascending = False)
best_mpg.head(1)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   manufacturer     234 non-null    object
 1   model            234 non-null    object
 2   displ            234 non-null    float64
 3   year             234 non-null    int64
 4   cyl              234 non-null    int64
 5   trans            234 non-null    object
 6   drv              234 non-null    object
 7   cty              234 non-null    int64
 8   hwy              234 non-null    int64
 9   fl               234 non-null    object
 10  class            234 non-null    object
 11  average_mileage  234 non-null    float64
dtypes: float64(2), int64(4), object(6)
memory usage: 23.8+ KB
None

                 displ    year  cyl        cty        hwy  average_mileage
manufacturer
honda         1.711111  2003.0  4.0  24.444444  32.555556             28.5

In [42]:
#1 B.How many different manufacturers are there?
len(cars["manufacturer"].value_counts())

15

In [46]:
#1 C. How many different models are there?
len(cars["model"].value_counts())

38

In [75]:
#1 D. Do automatic or manual cars have better miles per gallon? Manual trans has better mpg
automatic = cars[cars.trans.str.contains("auto")]
print(automatic.average_mileage.mean())
manual = cars[cars.trans.str.contains("m")]
print(manual.average_mileage.mean())

19.130573248407643
22.227272727272727

In [77]:
#2 Joining and Merging
# Copy the users and roles dataframes from the examples above. What do you think a right join 
# would look like? An outer join? What happens if you drop the foreign keys from the dataframes 
# and try to merge them?
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles
# Right Join
users_w_roles = pd.merge(users, roles, left_on='role_id', right_on='id', how='right')
users_w_roles

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [78]:
#Outer Join
users_w_roles = pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')
users_w_roles

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [81]:
#No foreign keys
users_w_roles = pd.merge(users, roles, how='right')
users_w_roles

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [90]:
#3 Getting data from SQL databases
# A.Create a function named get_db_url. It should accept a username, hostname, password, and 
# database name and return a url formatted like in the examples in this lesson.
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

def get_db_url(df):
    return user and host and password and url
print(get_db_url)

<function get_db_url at 0x7fb160563710>